'''
Каждый следующий элемент ряда Фибоначчи получается при сложении двух предыдущих. Начиная с 1 и 2, первые 10 элементов будут:
1, 2, 3, 5, 8, 13, 21, 34, 55, 89, ...
Найдите сумму всех четных элементов ряда Фибоначчи, которые не превышают четыре миллиона.

Each new term in the Fibonacci sequence is generated by adding the previous two terms. 
By starting with 1 and 2 the first 10 terms will be:
1, 2, 3, 5, 8, 13, 21, 34, 55, 89, ...
By considering the terms in the Fibonacci sequence whose values do not exceed four million, find the sum of the even-valued terms.
'''


fibs = []
fib_1 = 1
fib_2 = 2
while fib_1<=4000000:
    if fib_1 % 2 == 0:
        fibs.append(fib_1)
    if fib_2 %2 == 0:
        fibs.append(fib_2)
    fib_1 += fib_2
    fib_2 += fib_1

print(sum(fibs))
    
